app/Controllers/CMSController.php

    public function adminDashboard()
{

    $session = session();
    if ($session->get('role') !== 'admin') {
        return redirect()->to('/cms/login')->with('error', 'Access restricted.');
    }
    $data = [
        'title' => 'Admin Dashboard',
        'contentManagers' => (new UserModel())->where('role_id', 2)->findAll(),
---
SELECT *
FROM `users`
WHERE `role_id` = 2